zephyrproject-rtos/hal_realtek/bee/drivers/i2c/src/device/rtl87x2g/rtl_i2c.c
/*
 * Copyright (c) 2026, Realtek Semiconductor Corporation
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*============================================================================*
 *                        Header Files
 *============================================================================*/
#include "rtl_i2c.h"
#include "rtl_rcc.h"

/*============================================================================*
 *                           Private Functions
 *============================================================================*/
/* I2C Data Cmd Mask */
#define I2C_CMD_READ_BIT                             (BIT8)
#define I2C_CMD_STOP_BIT                             (BIT9)
#define I2C_CMD_RESTART_BIT                          (BIT10)

/* SDA Setup Time */
#define I2C_SDA_SETUP_TIME_VALUE                     (2)

/* SCL Low/High Period Time */
#define I2C_SCL_HIGH_PERIOD_COMPENSATE                          (7)
#define I2C_SCL_LOW_PERIOD_COMPENSATE                           (1)
#define NS_PER_SECOND                                           (1000000000)
/* I2C SCL High/Low min period according to spec */
#define I2C_FAST_MODE_PLUS_SCL_LOW_PERIOD_MIN_NS                (500)
#define I2C_FAST_MODE_PLUS_SCL_HIGH_PERIOD_MIN_NS               (260)
#define I2C_FAST_MODE_SCL_LOW_PERIOD_MIN_NS                     (1300)
#define I2C_FAST_MODE_SCL_HIGH_PERIOD_MIN_NS                    (600)
#define I2C_STANDARD_MODE_SCL_LOW_PERIOD_MIN_NS                 (4700)
#define I2C_STANDARD_MODE_SCL_HIGH_PERIOD_MIN_NS                (4000)
/* SDA Hold Time */
#define I2C_STANDARD_FAST_MODE_SDA_HOLD_TIME_NS                 (600)
#define I2C_FAST_MODE_PLUS_SDA_HOLD_TIME_NS                     (300)

#define ROUNDUP(a, b)                                (((a + b - 1) / b))

uint32_t I2C_TimeOut = 0xFFF;
static uint32_t I2C_RisingTimeNs;
extern uint8_t I2C_GetCompIndex(I2C_TypeDef *I2Cx);

/*============================================================================*
 *                           Public Functions
 *============================================================================*/
/**
  * \brief  Deinitializes the I2Cx peripheral registers to their default reset values.
  * \param  I2Cx: Select the I2C peripheral. \ref I2C_Declaration
  * \return None
  */
void I2C_DeInit(I2C_TypeDef *I2Cx)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    /*Disable I2C IP*/
    switch ((uint32_t)I2Cx)
    {
#ifdef I2C0
    case (uint32_t)I2C0:
        RCC_PeriphClockCmd(APBPeriph_I2C0, APBPeriph_I2C0_CLOCK, DISABLE);
        break;
#endif
#ifdef I2C1
    case (uint32_t)I2C1:
        RCC_PeriphClockCmd(APBPeriph_I2C1, APBPeriph_I2C1_CLOCK, DISABLE);
        break;
#endif
#ifdef I2C2
    case (uint32_t)I2C2:
        RCC_PeriphClockCmd(APBPeriph_I2C2, APBPeriph_I2C2_CLOCK, DISABLE);
        break;
#endif
#ifdef I2C3
    case (uint32_t)I2C3:
        RCC_PeriphClockCmd(APBPeriph_I2C3, APBPeriph_I2C3_CLOCK, DISABLE);
        break;
#endif

    default:
        break;
    }
}

/**
  * \brief  Initializes the I2Cx peripheral according to the specified
  *         parameters in the I2C_InitStruct.
  * \param  I2Cx: Select the I2C peripheral. \ref I2C_Declaration
  * \param  I2C_InitStruct: Pointer to a I2C_InitTypeDef structure that
  *         contains the configuration information for the specified I2C peripheral.
  * \return None
  */
void I2C_Init(I2C_TypeDef *I2Cx, I2C_InitTypeDef *I2C_InitStruct)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(IS_I2C_CLOCK_SPEED(I2C_InitStruct->I2C_ClockSpeed));

    /* Disable I2C device before change configuration */
    IC_ENABLE_TypeDef i2c_0x6c = {.d32 = I2Cx->IC_ENABLE};
    i2c_0x6c.b.ic_enable = 0x0;
    I2Cx->IC_ENABLE = i2c_0x6c.d32;

    /* Config sda tx hold time in different clock speed */
    uint8_t sda_tx_hold = 0;
    uint8_t compensate_index = I2C_GetCompIndex(I2Cx);
    uint32_t I2CSrcClk = 0;

    if (compensate_index == 6)
    {
        I2CSrcClk = 1000000;
    }
    else if (compensate_index == 7)
    {
        I2CSrcClk = 625000;
    }
    else
    {
        I2CSrcClk = 40000000 / BIT(compensate_index);
    }
    uint32_t i2c_source_clock_ns = NS_PER_SECOND / I2CSrcClk;

    if ((I2CSrcClk == 40000000) && (I2C_InitStruct->I2C_ClockSpeed > 400000))
    {
        sda_tx_hold = I2C_FAST_MODE_PLUS_SDA_HOLD_TIME_NS / i2c_source_clock_ns;
    }
    else
    {
        sda_tx_hold = (I2C_STANDARD_FAST_MODE_SDA_HOLD_TIME_NS / i2c_source_clock_ns == 0) ? 1 :
                      (I2C_STANDARD_FAST_MODE_SDA_HOLD_TIME_NS / i2c_source_clock_ns);
    }

    /* ------------------------------ Initialize I2C device ------------------------------*/
    if (I2C_DeviveMode_Master == I2C_InitStruct->I2C_DeviveMode)
    {
        /* Configure I2C device mode which can be selected for master or slave */
        IC_CON_TypeDef i2c_0x00 = {.d32 = I2Cx->IC_CON};
        i2c_0x00.b.master_mode = 0x1;
        i2c_0x00.b.ic_slave_disable = 0x1;
        i2c_0x00.b.ic_restart_en = 0x1;
        I2Cx->IC_CON = i2c_0x00.d32;

        /* Set target address */
        IC_TAR_TypeDef i2c_0x04 = {.d32 = I2Cx->IC_TAR};
        i2c_0x04.b.ic_10bitaddr_master = I2C_InitStruct->I2C_AddressMode;
        i2c_0x04.b.ic_tar = I2C_InitStruct->I2C_SlaveAddress;
        I2Cx->IC_TAR = i2c_0x04.d32;

        /* Set SDA hold time in master mode */
        IC_SDA_HOLD_TypeDef i2c_0x7c = {.d32 = I2Cx->IC_SDA_HOLD};
        i2c_0x7c.b.ic_sda_tx_hold = sda_tx_hold;
        i2c_0x7c.b.ic_sda_rx_hold = 0x1;
        I2Cx->IC_SDA_HOLD = i2c_0x7c.d32;

        I2C_RisingTimeNs = I2C_InitStruct->I2C_RisingTimeNs;
        /* Configure I2C speed */
        I2C_SetClockSpeed(I2Cx, I2C_InitStruct->I2C_ClockSpeed);
    }
    else
    {
        /* Set to slave mode */
        IC_CON_TypeDef i2c_0x00 = {.d32 = I2Cx->IC_CON};
        i2c_0x00.b.master_mode = 0x0;
        i2c_0x00.b.ic_10bitaddr_slave = I2C_InitStruct->I2C_AddressMode;
        i2c_0x00.b.ic_slave_disable = 0x0;
        I2Cx->IC_CON = i2c_0x00.d32;

        /* Set slave address */
        IC_SAR_TypeDef i2c_0x08 = {.d32 = I2Cx->IC_SAR};
        i2c_0x08.b.ic_sar = I2C_InitStruct->I2C_SlaveAddress;
        I2Cx->IC_SAR = i2c_0x08.d32;

        /* Set Ack in slave mode */
        IC_ACK_GENERAL_CALL_TypeDef i2c_0x98 = {.d32 = I2Cx->IC_ACK_GENERAL_CALL};
        i2c_0x98.b.ack_gen_call &= I2C_InitStruct->I2C_Ack;
        I2Cx->IC_ACK_GENERAL_CALL = i2c_0x98.d32;

