zephyrproject-rtos/hal_realtek/bee/drivers/i2c/src/device/rtl87x2g/rtl_i2c.c
        /* Set SDA hold time in slave mode */
        IC_SDA_HOLD_TypeDef i2c_0x7c = {.d32 = I2Cx->IC_SDA_HOLD};
        i2c_0x7c.b.ic_sda_tx_hold = sda_tx_hold;
        i2c_0x7c.b.ic_sda_rx_hold = 0x08;
        I2Cx->IC_SDA_HOLD = i2c_0x7c.d32;

        /* Set SDA setup time delay only in slave transmitter mode(greater than 2) ,delay time:[(IC_SDA_SETUP - 1) * (ic_clk_period)]*/
        IC_SDA_SETUP_TypeDef i2c_0x94 = {.d32 = I2Cx->IC_SDA_SETUP};
        i2c_0x94.b.sda_setup = I2C_SDA_SETUP_TIME_VALUE;
        I2Cx->IC_SDA_SETUP = i2c_0x94.d32;
    }

    /* Set Tx empty level */
    IC_TX_TL_TypeDef i2c_0x3c = {.d32 = I2Cx->IC_TX_TL};
    i2c_0x3c.b.tx_tl = I2C_InitStruct->I2C_TxThresholdLevel;
    I2Cx->IC_TX_TL = i2c_0x3c.d32;

    /*set Rx full level*/
    IC_RX_TL_TypeDef i2c_0x40 = {.d32 = I2Cx->IC_RX_TL};
    i2c_0x40.b.rx_tl = I2C_InitStruct->I2C_RxThresholdLevel;
    I2Cx->IC_RX_TL = i2c_0x40.d32;

    /* Config I2C dma mode */
    IC_DMA_CR_TypeDef i2c_0x88 = {.d32 = I2Cx->IC_DMA_CR};
    i2c_0x88.b.rdmae = I2C_InitStruct->I2C_RxDmaEn;
    i2c_0x88.b.tdmae = I2C_InitStruct->I2C_TxDmaEn;
    I2Cx->IC_DMA_CR = i2c_0x88.d32;

    /* Config I2C waterlevel */
    IC_DMA_TDLR_TypeDef i2c_0x8c = {.d32 = I2Cx->IC_DMA_TDLR};
    IC_DMA_RDLR_TypeDef i2c_0x90 = {.d32 = I2Cx->IC_DMA_RDLR};
    i2c_0x8c.b.dmatdl = I2C_InitStruct->I2C_TxWaterlevel;
    i2c_0x90.b.dmardl = I2C_InitStruct->I2C_RxWaterlevel;
    I2Cx->IC_DMA_TDLR = i2c_0x8c.d32;
    I2Cx->IC_DMA_RDLR = i2c_0x90.d32;

    /* Mask all interrupt */
    I2Cx->IC_INTR_MASK = 0x0;
}

/**
  * \brief  Fills each I2C_InitStruct member with its default value.
  * \param  I2C_InitStruct : pointer to a I2C_InitTypeDef structure which will be initialized.
  * \return None
  */
void I2C_StructInit(I2C_InitTypeDef *I2C_InitStruct)
{
    /* I2C source clock is 40MHz, depending on clock divider */
    I2C_InitStruct->I2C_Clock             = 40000000;
    /* I2C SCK freqency is 400KHz */
    I2C_InitStruct->I2C_ClockSpeed        = 400000;
    /* Master mode */
    I2C_InitStruct->I2C_DeviveMode        = I2C_DeviveMode_Master;
    /* 7-bit address mode */
    I2C_InitStruct->I2C_AddressMode       = I2C_AddressMode_7BIT;
    /* Set slave address */
    I2C_InitStruct->I2C_SlaveAddress      = 0;
    /* Enable acknowledge in slave mode */
    I2C_InitStruct->I2C_Ack               = ENABLE;
    /* Tx fifo depth: 24 * 8bits */
    I2C_InitStruct->I2C_TxThresholdLevel  = 0;
    /* Rx fifo depth: 24 * 8bits */
    I2C_InitStruct->I2C_RxThresholdLevel  = 0;
    /* Disable dma */
    I2C_InitStruct->I2C_TxDmaEn           = DISABLE;
    I2C_InitStruct->I2C_RxDmaEn           = DISABLE;
    /* I2C Tx waterlevel, should be less than fifo threshold.
       The best value is I2C FIFO Depth - GDMA Msize */
    I2C_InitStruct->I2C_TxWaterlevel      = 23;
    /* I2C Rx waterlevel, should be less than fifo threshold.
       The best value is GDMA Msize */
    I2C_InitStruct->I2C_RxWaterlevel      = 1;
    /* Specify I2C scl rising time with 2.2K ohm pull up resistor, the unit is ns*/
    I2C_InitStruct->I2C_RisingTimeNs     = 50;

}

/**
  * \brief  Enable or disable the specified I2C peripheral.
  * \param  I2Cx: Select the I2C peripheral. \ref I2C_Declaration
  * \param  NewState: New state of the I2Cx peripheral.
  *         This parameter can be: ENABLE or DISABLE.
  * \return None
  */
void I2C_Cmd(I2C_TypeDef *I2Cx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    /* Enable or disable the selected I2C peripheral */
    IC_ENABLE_TypeDef i2c_0x6c = {.d32 = I2Cx->IC_ENABLE};
    i2c_0x6c.b.ic_enable = NewState;
    I2Cx->IC_ENABLE = i2c_0x6c.d32;
}


/**
  * \brief  Checks whether the last I2Cx abort status.
  * \param  I2Cx: Select the I2C peripheral. \ref I2C_Declaration
  * \return I2C_Status: The status of I2Cx. \ref I2C_Status
  */
I2C_Status I2C_CheckAbortStatus(I2C_TypeDef *I2Cx)
{
    uint32_t abort_status = 0;

    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    /* Get abort status */
    abort_status = I2Cx->IC_TX_ABRT_SOURCE;

    if (abort_status & MS_ALL_ABORT)
    {
        /* Clear abort status */
        (void)I2Cx->IC_CLR_TX_ABRT;

        /* Check abort type */
        if (abort_status & ABRT_TXDATA_NOACK)
        {
            return I2C_ABRT_TXDATA_NOACK;
        }

        if (abort_status & ABRT_7B_ADDR_NOACK)
        {
            return I2C_ABRT_7B_ADDR_NOACK;
        }

        if (abort_status & ARB_LOST)
        {
            return I2C_ARB_LOST;
        }

        if (abort_status & ABRT_MASTER_DIS)
        {
            return I2C_ABRT_MASTER_DIS;
        }

        if (abort_status & ABRT_10ADDR1_NOACK)
        {
            return I2C_ABRT_10ADDR1_NOACK;
        }

        if (abort_status & ABRT_10ADDR2_NOACK)
        {
            return I2C_ABRT_10ADDR2_NOACK;
        }
    }

    return I2C_Success;
}

I2C_Status I2C_WaitForFIFO(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG)
{
    uint32_t timeout = I2C_TimeOut;

    /* Wait until the FIFO condition selected by I2C_FLAG becomes true:
     * - TX: writable (TX FIFO Not Full, space available)
     * - RX: readable (RX FIFO Not Empty, data available)
     */
    while (((I2Cx->IC_STATUS & I2C_FLAG) == 0) && (timeout != 0))
    {
        I2C_Status status = I2C_CheckAbortStatus(I2Cx);
        if (status != I2C_Success)
        {
            return status;
        }

        if (--timeout == 0)
        {
            return I2C_ERR_TIMEOUT;
        }
    }

    return I2C_CheckAbortStatus(I2Cx);
}

I2C_Status I2C_WaitTXIdle(I2C_TypeDef *I2Cx)
{
    uint32_t timeout = I2C_TimeOut;

    /* Wait until the transmit is fully completed:
     * - Bus becomes idle (ACTIVITY == 0)
     * - TX FIFO is empty (TFE == 1)
     */
    while ((((I2Cx->IC_STATUS & I2C_FLAG_ACTIVITY) != 0) ||
            ((I2Cx->IC_STATUS & I2C_FLAG_TFE) == 0)) &&
           (timeout != 0))
    {
        I2C_Status status = I2C_CheckAbortStatus(I2Cx);
        if (status != I2C_Success)
        {
            return status;
        }

        if (--timeout == 0)
        {
            return I2C_ERR_TIMEOUT;
        }
    }

