zephyrproject-rtos/hal_realtek/bee/drivers/i2c/src/device/rtl87x2g/rtl_i2c.c
    return I2C_Success;
}


/**
  * \brief  Send data in master mode through the I2Cx peripheral.
  * \param  I2Cx: Select the I2C peripheral. \ref I2C_Declaration
  * \param  pBuf: Byte to be transmitted.
  * \param  len: Data length to send.
  * \return I2C_Status: The status of I2Cx. \ref I2C_Status
  */
I2C_Status I2C_MasterWrite(I2C_TypeDef *I2Cx, uint8_t *pBuf, uint16_t len)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    I2C_Status status = I2C_Success;

    for (uint16_t i = 0; i < len; i++)
    {
        uint32_t cmd = *pBuf++;
        if (i == (len - 1))
        {
            cmd |= I2C_CMD_STOP_BIT;
        }
        I2Cx->IC_DATA_CMD = cmd;

        status = I2C_WaitForFIFO(I2Cx, I2C_FLAG_TFNF);
        if (status != I2C_Success)
        {
            return status;
        }
    }

    return I2C_WaitTXIdle(I2Cx);
}

/**
  * \brief  Send device write data in master mode through the I2Cx peripheral.
  * \param  I2Cx: Select the I2C peripheral. \ref I2C_Declaration
  * \param  Data: Byte to be transmitted..
  * \return None
  */
I2C_Status I2C_MasterWriteDevice(I2C_TypeDef *I2Cx, uint8_t *pBuf, uint16_t len, uint8_t *pbuf2,
                                 uint32_t len2)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    I2C_Status status = I2C_Success;

    /* Write in the DR register the data to be sent */
    for (uint16_t i = 0; i < len; i++)
    {
        I2Cx->IC_DATA_CMD = *pBuf++;

        status = I2C_WaitForFIFO(I2Cx, I2C_FLAG_TFNF);
        if (status != I2C_Success)
        {
            return status;
        }
    }

    for (uint16_t i = 0; i < len2; i++)
    {
        uint32_t cmd = *pbuf2++;
        if (i == (len2 - 1))
        {
            cmd |= I2C_CMD_STOP_BIT;
        }
        I2Cx->IC_DATA_CMD = cmd;

        status = I2C_WaitForFIFO(I2Cx, I2C_FLAG_TFNF);
        if (status != I2C_Success)
        {
            return status;
        }
    }

    return I2C_WaitTXIdle(I2Cx);
}

/**
  * \brief  Read data in master mode through the I2Cx peripheral.
  * \param  I2Cx: Select the I2C peripheral. \ref I2C_Declaration
  * \param  pBuf: Data buffer to receive data.
  * \param  len: Read data length.
  * \return I2C_Status: The status of I2Cx. \ref I2C_Status
  */
I2C_Status I2C_MasterRead(I2C_TypeDef *I2Cx, uint8_t *pBuf, uint16_t len)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    I2C_Status status = I2C_Success;

    if (len == 0)
    {
        return status;
    }

    /* Issue the first read cmd. If only one byte is requested, append STOP immediately. */
    uint32_t cmd = 0x0 | I2C_CMD_READ_BIT;
    if (len == 1)
    {
        cmd |= I2C_CMD_STOP_BIT;
    }
    I2Cx->IC_DATA_CMD = cmd;

    for (uint16_t i = 1; i < len; i++)
    {
        /* Issue the remaining read cmd. */
        cmd = 0x0 | I2C_CMD_READ_BIT;
        if (i == (len - 1))
        {
            cmd |= I2C_CMD_STOP_BIT;
        }
        I2Cx->IC_DATA_CMD = cmd;

        /* Read byte produced by the read. */
        status = I2C_WaitForFIFO(I2Cx, I2C_FLAG_RFNE);
        if (status != I2C_Success)
        {
            return status;
        }
        *pBuf++ = (uint8_t)I2Cx->IC_DATA_CMD;
    }

    /* Read the final byte produced by the last command. */
    status = I2C_WaitForFIFO(I2Cx, I2C_FLAG_RFNE);
    if (status != I2C_Success)
    {
        return status;
    }
    *pBuf = (uint8_t)I2Cx->IC_DATA_CMD;

    return status;
}

/**
  * \brief  Sends data and read data in master mode through the I2Cx peripheral.Attention:Read data with time out mechanism.
  * \param  I2Cx: Select the I2C peripheral. \ref I2C_Declaration
  * \param  pWriteBuf: Data buffer to send before read.
  * \param  Writelen: Send data length.
  * \param  pReadBuf: Data buffer to receive.
  * \param  Readlen: Receive data length.
  * \return I2C_Status: The status of I2Cx. \ref I2C_Status
  */
I2C_Status I2C_RepeatRead(I2C_TypeDef *I2Cx, uint8_t *pWriteBuf, uint16_t Writelen,
                          uint8_t *pReadBuf, uint16_t Readlen)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    I2C_Status status = I2C_Success;

    for (uint16_t i = 0; i < Writelen; i++)
    {
        I2Cx->IC_DATA_CMD = *pWriteBuf++;

        status = I2C_WaitForFIFO(I2Cx, I2C_FLAG_TFNF);
        if (status != I2C_Success)
        {
            return status;
        }
    }

    for (uint16_t i = 0; i < Readlen; i++)
    {
        /* Issue the read cmd. */
        uint32_t cmd = 0x0 | I2C_CMD_READ_BIT;
        if (i == (Readlen - 1))
        {
            cmd |= I2C_CMD_STOP_BIT;
        }
        I2Cx->IC_DATA_CMD = cmd;

        /* Read byte produced by the read. */
        status = I2C_WaitForFIFO(I2Cx, I2C_FLAG_RFNE);
        if (status != I2C_Success)
        {
            return status;
        }
        *pReadBuf++ = (uint8_t)I2Cx->IC_DATA_CMD;
    }


    return status;
}

/**
  * \brief Mask the specified I2C interrupt.
  * \param  I2Cx: Select the I2C peripheral. \ref I2C_Declaration
  * \param  I2C_INT: This parameter can be one of the following values:
  *         \arg I2C_INT_MST_ON_HOLD: Indicates whether a master is holding the bus.
  *         \arg I2C_INT_GEN_CALL: Set only when a General Call address is received and it is acknowledged.
  *         \arg I2C_INT_START_DET: Indicates whether a START or RESTART condition has occurred on the I2C
  *              interface regardless of whether I2C is operating in slave or master mode.
  *         \arg I2C_INT_STOP_DET: Indicates whether a STOP condition has occurred on the I2C interface regardless
  *              of whether I2C is operating in slave or master mode
  *         \arg I2C_INT_ACTIVITY: This bit captures I2C activity and stays set until it is cleared.
  *         \arg I2C_INT_RX_DONE: When the I2C is acting as a slave-transmitter, this bit is set to 1 if the
  *              master does not acknowledge a transmitted byte. This occurs on the last byte of
  *              the transmission, indicating that the transmission is done.
  *         \arg I2C_INT_TX_ABRT: This bit indicates if I2C as an I2C transmitter, is unable to complete the
  *              intended actions on the contents of the transmit FIFO.
  *         \arg I2C_INT_RD_REQ: This bit is set to 1 when acting as a slave and another I2C master
  *              is attempting to read data.
  *         \arg I2C_INT_TX_EMPTY: This bit is set to 1 when the transmit buffer is at or below the threshold value set
  *              in the IC_TX_TL register.
  *         \arg I2C_INT_TX_OVER: Set during transmit if the transmit buffer is filled to IC_TX_BUFFER_DEPTH and
  *              the processor attempts to issue another I2C command.
  *         \arg I2C_INT_RX_FULL: Set when the receive buffer reaches or goes above the RX_TL threshold in the
  *              IC_RX_TL register
  *         \arg I2C_INT_RX_OVER: Set if the receive buffer is completely filled to IC_RX_BUFFER_DEPTH and an
  *              additional byte is received from an external I2C device.
  *         \arg I2C_INT_RX_UNDER: Set if the processor attempts to read the receive buffer when it is empty by reading.
  * \return None.
  */
void I2C_INTConfig(I2C_TypeDef *I2Cx, uint16_t I2C_INT, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(I2C_GET_INT(I2C_INT));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE)
    {
        /* Enable the selected I2C interrupts */
        I2Cx->IC_INTR_MASK |= I2C_INT;
    }
    else
    {
        /* Disable the selected I2C interrupts */
        I2Cx->IC_INTR_MASK &= (uint16_t)~I2C_INT;
    }
}

/**
  * \brief clear the specified I2C interrupt.
  * \param  I2Cx: Select the I2C peripheral. \ref I2C_Declaration
  * \param  I2C_INT: This parameter can be one of the following values:
  *         \arg I2C_INT_GEN_CALL: Set only when a General Call address is received and it is acknowledged.
  *         \arg I2C_INT_START_DET: Indicates whether a START or RESTART condition has occurred on the I2C
  *              interface regardless of whether I2C is operating in slave or master mode.
  *         \arg I2C_INT_STOP_DET: Indicates whether a STOP condition has occurred on the I2C interface regardless
  *              of whether I2C is operating in slave or master mode
  *         \arg I2C_INT_ACTIVITY: This bit captures I2C activity and stays set until it is cleared.
  *         \arg I2C_INT_RX_DONE: When the I2C is acting as a slave-transmitter, this bit is set to 1 if the
  *              master does not acknowledge a transmitted byte. This occurs on the last byte of
  *              the transmission, indicating that the transmission is done.
  *         \arg I2C_INT_TX_ABRT: This bit indicates if I2C as an I2C transmitter, is unable to complete the
  *              intended actions on the contents of the transmit FIFO.
  *         \arg I2C_INT_RD_REQ: This bit is set to 1 when acting as a slave and another I2C master
  *              is attempting to read data.
  *         \arg I2C_INT_TX_EMPTY: This bit is set to 1 when the transmit buffer is at or below the threshold value set
  *              in the IC_TX_TL register.
  *         \arg I2C_INT_TX_OVER: Set during transmit if the transmit buffer is filled to IC_TX_BUFFER_DEPTH and
  *              the processor attempts to issue another I2C command.
  *         \arg I2C_INT_RX_FULL: Set when the receive buffer reaches or goes above the RX_TL threshold in the
  *              IC_RX_TL register
  *         \arg I2C_INT_RX_OVER: Set if the receive buffer is completely filled to IC_RX_BUFFER_DEPTH and an
  *              additional byte is received from an external I2C device.
  *         \arg I2C_INT_RX_UNDER: Set if the processor attempts to read the receive buffer when it is empty by reading.
  * \return None.
  */
void I2C_ClearINTPendingBit(I2C_TypeDef *I2Cx, uint16_t I2C_IT)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(I2C_GET_INT(I2C_IT));

    switch (I2C_IT)
    {
    case I2C_INT_RX_UNDER:
        {
            (void)I2Cx->IC_CLR_RX_UNDER;
            break;
        }
    case I2C_INT_RX_OVER:
        {
            (void)I2Cx->IC_CLR_RX_OVER;
            break;
        }
    case I2C_INT_TX_OVER:
        {
            (void)I2Cx->IC_CLR_TX_OVER;
            break;
        }
    case I2C_INT_RD_REQ:
        {
            (void)I2Cx->IC_CLR_RD_REQ;
            break;
        }
    case I2C_INT_TX_ABRT:
        {
            (void)I2Cx->IC_CLR_TX_ABRT;
            break;
        }
    case I2C_INT_RX_DONE:
        {
            (void)I2Cx->IC_CLR_RX_DONE;
            break;
        }
    case I2C_INT_ACTIVITY:
        {
            (void)I2Cx->IC_CLR_ACTIVITY;
            break;
        }
    case I2C_INT_STOP_DET:
        {
            (void)I2Cx->IC_CLR_STOP_DET;
            break;
        }
    case I2C_INT_START_DET:
        {
            (void)I2Cx->IC_CLR_START_DET;
            break;
        }
    case I2C_INT_GEN_CALL:
        {
            (void)I2Cx->IC_CLR_GEN_CALL;
            break;
        }
    default:
        {
            break;
        }
    }
}

/**
 * \brief   Set slave device address.
 * \param   I2Cx: Select the I2C peripheral. \ref I2C_Declaration
 * \param   Address: Specifies the slave address which will be transmitte.
 * \return  None.
 */
void I2C_SetSlaveAddress(I2C_TypeDef *I2Cx, uint16_t Address)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    /* Configure new target address */
    IC_TAR_TypeDef i2c_0x04 = {.d32 = I2Cx->IC_TAR};
    i2c_0x04.b.ic_tar = Address;
    I2Cx->IC_TAR = i2c_0x04.d32;
}

/**
 * \brief   Write command through the I2Cx peripheral.
 * \param   I2Cx: Select the I2C peripheral. \ref I2C_Declaration
 * \param   command: Command of write or read.
 *          \arg I2C_READ_CMD: Read command. Data which want to transmit can be 0 in this situation.
 *          \arg I2C_WRITE_CMD: Write command.
 * \param   data: Data which to be transmitted.
 * \param   StopState: Whether send stop signal.
 *          \arg ENABLE: Send stop signal.
 *          \arg DISABLE: Do not send stop signal.
 * \return  None.
 */
void I2C_SendCmd(I2C_TypeDef *I2Cx, I2CSendCommend_TypeDef command, uint8_t data,
                 FunctionalState StopState)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(IS_I2C_CMD(command));

    IC_DATA_CMD_TypeDef i2c_0x10 = {.d32 = 0};
    i2c_0x10.d32 = 0;
    i2c_0x10.b.cmd = command;
    i2c_0x10.b.stop = StopState;
    i2c_0x10.b.dat = data;
    I2Cx->IC_DATA_CMD = i2c_0x10.d32;
}

/**
 * \brief   Received data by the I2Cx peripheral.
 * \param   I2Cx: Select the I2C peripheral. \ref I2C_Declaration
 * \return  Return the most recent received data.
 */
uint8_t I2C_ReceiveData(I2C_TypeDef *I2Cx)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    /* Return the data in the DR register */
    return (uint8_t)I2Cx->IC_DATA_CMD;
}

/**
 * \brief   Get data length in Rx FIFO of the I2Cx peripheral.
 * \param   I2Cx: Select the I2C peripheral. \ref I2C_Declaration
 * \return  Current data number in Rx FIFO.
 */
uint8_t I2C_GetRxFIFOLen(I2C_TypeDef *I2Cx)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    return (uint8_t)I2Cx->IC_RXFLR;
}

/**
 * \brief   Get data length in Tx FIFO of the I2Cx peripheral.
 * \param   I2Cx: Select the I2C peripheral. \ref I2C_Declaration
 * \return  Current data number in Tx FIFO.
 */
uint8_t I2C_GetTxFIFOLen(I2C_TypeDef *I2Cx)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    return (uint8_t)I2Cx->IC_TXFLR;
}

/**
 * \brief   Clear all I2C interrupt.
 * \param   I2Cx: Select the I2C peripheral. \ref I2C_Declaration
 * \return  None.
 */
void I2C_ClearAllINT(I2C_TypeDef *I2Cx)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    (void)I2Cx->IC_CLR_INTR;
}

/**
 * \brief   Check whether the specified I2C flag is set.
 * \param   I2Cx: Select the I2C peripheral. \ref I2C_Declaration
 * \param   I2C_FLAG: Specifies the flag to check.
 *          This parameter can be one of the following values:
 *          \arg I2C_FLAG_SLV_HOLD_RX_FIFO_FULL: The BUS Hold in Slave mode due to the Rx FIFO being Full and an additional byte being received.
 *          \arg I2C_FLAG_SLV_HOLD_TX_FIFO_EMPTY: The BUS Hold in Slave mode for the Read request when the Tx FIFO is empty.
 *          \arg I2C_FLAG_MST_HOLD_RX_FIFO_FULL: The BUS Hold in Master mode due to Rx FIFO is full and additional byte has been received.
 *          \arg I2C_FLAG_MST_HOLD_TX_FIFO_EMPTY: The BUS hold when the master holds the bus because of the Tx FIFO being empty.
 *          \arg I2C_FLAG_SLV_ACTIVITY: Slave FSM activity status.
 *          \arg I2C_FLAG_MST_ACTIVITY: Master FSM activity status.
 *          \arg I2C_FLAG_RFF: Receive FIFO completely full.
 *          \arg I2C_FLAG_RFNE: Receive FIFO not empty.
 *          \arg I2C_FLAG_TFE: Transmit FIFO completely empty.
 *          \arg I2C_FLAG_TFNF: Transmit FIFO not full.
 *          \arg I2C_FLAG_ACTIVITY: I2C activity status.
 */
FlagStatus I2C_GetFlagState(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG)
{
    FlagStatus bit_status = RESET;

    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(IS_I2C_GET_FLAG(I2C_FLAG));

    if ((I2Cx->IC_STATUS & I2C_FLAG) != (uint32_t)RESET)
    {
        /* I2C_FLAG is set */
        bit_status = SET;
    }

    /* Return the I2C_FLAG status */
    return  bit_status;
}

/**
 * \brief   Check whether the last I2Cx event is equal to the one passed as parameter.
 * \param   I2Cx: Select the I2C peripheral. \ref I2C_Declaration
 * \param   I2C_EVENT: specifies the event to be checked about I2C Transmit Abort Status Register.
 *          This parameter can be one of the following values:
 *          \arg ABRT_SLVRD_INTX: When the processor side responds to a slave mode request for data to be transmitted to a remote master and user send read command.
 *          \arg ABRT_SLV_ARBLOST: Slave lost the bus while transmitting data to a remote master.
 *          \arg ABRT_SLVFLUSH_TXFIFO: Slave has received a read command and some data exists in the TX FIFO so the slave issues a TX_ABRT interrupt to flush old data in TX FIFO.
 *          \arg ARB_LOST: Master has lost arbitration or the slave transmitter has lost arbitration.
 *          \arg ABRT_MASTER_DIS: User tries to initiate a Master operation with the Master mode disabled
 *          \arg ABRT_10B_RD_NORSTRT: The restart is disabled and the master sends a read command in 10-bit addressing mode.
 *          \arg ABRT_SBYTE_NORSTRT: The restart is disabled and the user is trying to send a START Byte.
 *          \arg ABRT_HS_NORSTRT: The restart is disabled and the user is trying to use the master to transfer data in High Speed mode.
 *          \arg ABRT_SBYTE_ACKDET: Master has sent a START Byte and the START Byte was acknowledged (wrong behavior).
 *          \arg ABRT_HS_ACKDET: Master is in High Speed mode and the High Speed Master code was acknowledged (wrong behavior).
 *          \arg ABRT_GCALL_READ: Sent a General Call but the user programmed the byte following the General Call to be a read from the bus.
 *          \arg ABRT_GCALL_NOACK: Sent a General Call and no slave on the bus acknowledged the General Call.
 *          \arg ABRT_TXDATA_NOACK: Master sent data byte(s) following the address, it did not receive an acknowledge from the remote slave.
 *          \arg ABRT_10ADDR2_NOACK: Master is in 10-bit address mode and the second address byte of the 10-bit address was not acknowledged by any slave.
 *          \arg ABRT_10ADDR1_NOACK: Master is in 10-bit address mode and the first 10-bit address byte was not acknowledged by any slave.
 *          \arg ABRT_7B_ADDR_NOACK: Master is in 7-bit addressing mode and th address sent was not acknowledged by any slave.
 * \return  An ErrorStatus enumeration value.
 *          \retval  SUCCESS: Last event is equal to the I2C_EVENT.
 *          \retval  ERROR: Last event is different from the I2C_EVENT.
 */
FlagStatus I2C_CheckEvent(I2C_TypeDef *I2Cx, uint32_t I2C_EVENT)
{
    FlagStatus bit_status = RESET;

    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(IS_I2C_EVENT(I2C_EVENT));

    if ((I2Cx->IC_TX_ABRT_SOURCE & I2C_EVENT) != (uint32_t)RESET)
    {

        bit_status = SET;
    }

    /* Return the I2C event status */
    return  bit_status;
}

/**
 * \brief   Get the specified I2C interrupt status.
 * \param   I2Cx: Select the I2C peripheral. \ref I2C_Declaration
 * \param   I2C_IT: This parameter can be one of the following values:
 *          \arg I2C_INT_MST_ON_HOLD: Indicates whether a master is holding the bus.
 *          \arg I2C_INT_GEN_CALL: Set only when a General Call address is received and it is acknowledged.
 *          \arg I2C_INT_START_DET: Indicates whether a START or RESTART condition has occurred on the I2C
 *               interface regardless of whether DW_apb_i2c is operating in slave or master mode.
 *          \arg I2C_INT_STOP_DET: Indicates whether a STOP condition has occurred on the I2C interface regardless
 *               of whether DW_apb_i2c is operating in slave or master mode
 *          \arg I2C_INT_ACTIVITY: This bit captures DW_apb_i2c activity and stays set until it is cleared.
 *          \arg I2C_INT_RX_DONE: When the DW_apb_i2c is acting as a slave-transmitter, this bit is set to 1 if the
 *               master does not acknowledge a transmitted byte. This occurs on the last byte of
 *               the transmission, indicating that the transmission is done.
 *          \arg I2C_INT_TX_ABRT: This bit indicates if DW_apb_i2c, as an I2C transmitter, is unable to complete the
 *               intended actions on the contents of the transmit FIFO.
 *          \arg I2C_INT_RD_REQ: This bit is set to 1 when acting as a slave and another I2C master
 *               is attempting to read data.
 *          \arg I2C_INT_TX_EMPTY: This bit is set to 1 when the transmit buffer is at or below the threshold value set
 *               in the IC_TX_TL register.
 *          \arg I2C_INT_TX_OVER: Set during transmit if the transmit buffer is filled to IC_TX_BUFFER_DEPTH and
 *               the processor attempts to issue another I2C command.
 *          \arg I2C_INT_RX_FULL: Set when the receive buffer reaches or goes above the RX_TL threshold in the
 *               IC_RX_TL register
 *          \arg I2C_INT_RX_OVER: Set if the receive buffer is completely filled to IC_RX_BUFFER_DEPTH and an
 *               additional byte is received from an external I2C device.
 *          \arg I2C_INT_RX_UNDER: Set if the processor attempts to read the receive buffer when it is empty by reading.
 * \return  The new state of I2C_IT (SET or RESET).
 */
ITStatus I2C_GetINTStatus(I2C_TypeDef *I2Cx, uint32_t I2C_IT)
{
    ITStatus bit_status = RESET;

    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(I2C_GET_INT(I2C_IT));

    if ((I2Cx->IC_INTR_STAT & I2C_IT) != (uint32_t)RESET)
    {
        bit_status = SET;
    }

    /* Return the I2C_IT status */
    return  bit_status;
}

/**
 * \brief   Enable or disable the I2Cx GDMA interface.
 * \param   I2Cx: Select the I2C peripheral. \ref I2C_Declaration
 * \param   I2C_GDMAReq: Specifies the I2C GDMA transfer request to be enabled or disabled.
 *          This parameter can be one of the following values:
 *          \arg I2C_GDMAReq_Tx: Tx buffer GDMA transfer request.
 *          \arg I2C_GDMAReq_Rx: Rx buffer GDMA transfer request.
 * \param   NewState: New state of the selected I2C GDMA transfer request.
 *          This parameter can be: ENABLE or DISABLE.
 * \return None.
 */
void I2C_GDMACmd(I2C_TypeDef *I2Cx, I2CGdmaTransferRequests_TypeDef I2C_GDMAReq,
                 FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    assert_param(IS_I2C_GDMAREQ(I2C_GDMAReq));

    if (NewState != DISABLE)
    {
        /* Enable the selected I2C GDMA request */
        I2Cx->IC_DMA_CR |= I2C_GDMAReq;
    }
    else
    {
        /* Disable the selected I2C GDMA request */
        I2Cx->IC_DMA_CR &= (uint16_t)~(I2C_GDMAReq);
    }
}

/**
  * \brief  Set Clock Speed through the I2Cx peripheral.
  * \param  I2Cx: Select the I2C peripheral. \ref I2C_Declaration
  * \param  I2C_ClockSpeed: CLock speed.
  * \return None
  */
void I2C_SetClockSpeed(I2C_TypeDef *I2Cx, uint32_t I2C_ClockSpeed)
{
    uint8_t compensate_index = 0;
    uint32_t tick_clksrc_ns = 0;
    uint32_t I2CSrcClk = 0;
    uint32_t allowedSpeed = 0;
    uint32_t spklen = 0;
    uint32_t scl_low_period_spec_min_ns = 0;
    uint32_t scl_high_period_spec_min_ns = 0;
    uint32_t scl_lcnt_min = 0;
    uint32_t scl_hcnt_min = 0;
    uint32_t scl_low_period_min_ns = 0;
    uint32_t scl_high_period_min_ns = 0;
    uint32_t tick_clkspeed_ns = 0;
    uint32_t total_period_ns = 0;
    uint32_t total_hcnt_lcnt = 0;
    int32_t remaining = 0;
    uint32_t scl_lcnt = 0;
    uint32_t scl_hcnt = 0;

    /* Obtain the I2C Clock source based on the I2C divider. */
    compensate_index = I2C_GetCompIndex(I2Cx);
    if (compensate_index == 6)
    {
        I2CSrcClk = 1000000;
    }
    else if (compensate_index == 7)
    {
        I2CSrcClk = 625000;
    }
    else
    {
        I2CSrcClk = 40000000 / BIT(compensate_index);
    }

    /* Tick of I2C clock source in ns. */
    tick_clksrc_ns = NS_PER_SECOND / I2CSrcClk;

