zephyrproject-rtos/hal_realtek/bee/drivers/i2c/src/device/rtl87x2g/rtl_i2c.c
    /* Limit the maximum I2C speed according to the I2C clock source. */
    if (I2CSrcClk == 40000000)
    {
        allowedSpeed = 1000000;
    }
    else if (I2CSrcClk == 20000000)
    {
        allowedSpeed = 400000;
    }
    else
    {
        allowedSpeed = 100000;
    }
    /* Set Max I2C Clock speed. */
    I2C_ClockSpeed = (I2C_ClockSpeed > allowedSpeed) ? allowedSpeed : I2C_ClockSpeed;

    /* Set the spike time according to SPEC */
    /* For Standard mode, there is no limit on spike suppression time, use default value. */
    if (I2C_ClockSpeed <= 100000)
    {
        spklen = 0x05;
    }
    /* For Fast mode (plus), the max spike suppression time is 50ns. */
    else
    {
        spklen = 0x01;
    }

    /* Set suppression limit */
    I2Cx->IC_FS_SPKLEN = spklen & 0xFFFF;


    /******************* Calulate the SCL low high count based on SPEC *******************/
    /* Get the minimum of scl low high period specified in the spec */
    if (I2C_ClockSpeed <= 100000)
    {
        scl_low_period_spec_min_ns = I2C_STANDARD_MODE_SCL_LOW_PERIOD_MIN_NS;
        scl_high_period_spec_min_ns = I2C_STANDARD_MODE_SCL_HIGH_PERIOD_MIN_NS;
    }
    else if (I2C_ClockSpeed <= 400000)
    {
        scl_low_period_spec_min_ns = I2C_FAST_MODE_SCL_LOW_PERIOD_MIN_NS;
        scl_high_period_spec_min_ns = I2C_FAST_MODE_SCL_HIGH_PERIOD_MIN_NS;
    }
    else
    {
        scl_low_period_spec_min_ns = I2C_FAST_MODE_PLUS_SCL_LOW_PERIOD_MIN_NS;
        scl_high_period_spec_min_ns = I2C_FAST_MODE_PLUS_SCL_HIGH_PERIOD_MIN_NS;
    }

    /* Calulate the minimum of scl low high period based on LCNT/HCNT specified in hardware:
     *
     * Firstly, get the minimum LCNT HCNT specified in hardware.
     * - LCNT: IC_SS_SCL_LCNT and IC_FS_SCL_LCNT register values must be larger than IC_FS_SPKLEN + 7.
     * - HCNT: IC_SS_SCL_HCNT and IC_FS_SCL_HCNT register values must be larger than IC_FS_SPKLEN + 5.
     * Use +1 to enforce strictly greater with integer registers.
     *
     * Secondly, calulate the minimum of scl high/low period based on the LCNT/HCNT.
     */

    scl_lcnt_min = spklen + 7 + 1;
    scl_hcnt_min = spklen + 5 + 1;
    scl_low_period_min_ns = (scl_lcnt_min + I2C_SCL_LOW_PERIOD_COMPENSATE) * tick_clksrc_ns;
    scl_high_period_min_ns = (scl_hcnt_min + spklen + I2C_SCL_HIGH_PERIOD_COMPENSATE) *
                             tick_clksrc_ns;

    /* Final minimum: satisfy both spec and hardware. */
    scl_low_period_min_ns = (scl_low_period_min_ns > scl_low_period_spec_min_ns) ?
                            scl_low_period_min_ns : scl_low_period_spec_min_ns;
    scl_high_period_min_ns = (scl_high_period_min_ns > scl_high_period_spec_min_ns) ?
                             scl_high_period_min_ns : scl_high_period_spec_min_ns;

    scl_lcnt_min = ROUNDUP(scl_low_period_min_ns, tick_clksrc_ns) - I2C_SCL_LOW_PERIOD_COMPENSATE;
    scl_hcnt_min = ROUNDUP(scl_high_period_min_ns,
                           tick_clksrc_ns) - spklen - I2C_SCL_HIGH_PERIOD_COMPENSATE;

    /*************** Calulate the SCL low high count based on I2C_Clock_Speed ***************/

    /* Calculate target total (high+low) counter based on the desired frequency of I2C SCL.
     * Firstly, calulate the total period: tick_clkspeed_ns minus I2C_RisingTimeNs.
     *   - Notes: I2C_RisingTimeNs should be below the range.
     * Secondly, total_period_ns div tick_clksrc_ns, round up.
     * Then subtract SPKLEN and path compensations to get pure HCNT+LCNT sum.
     */

    tick_clkspeed_ns = NS_PER_SECOND / I2C_ClockSpeed;
    total_period_ns = tick_clkspeed_ns - I2C_RisingTimeNs;
    total_hcnt_lcnt = (ROUNDUP(total_period_ns, tick_clksrc_ns)
                       - spklen - I2C_SCL_HIGH_PERIOD_COMPENSATE - I2C_SCL_LOW_PERIOD_COMPENSATE);

    /***************** Distibute the remaining count to the SCL low high *****************/

    /* Calculate the remaining as total_hcnt_lcnt - (scl_lcnt_min + scl_hcnt_min),
     * distribute the remaining counts between low and high count.
     */

    remaining = total_hcnt_lcnt - scl_lcnt_min - scl_hcnt_min;
    scl_lcnt = scl_lcnt_min;
    scl_hcnt = scl_hcnt_min;
    if (remaining > 0)
    {
        scl_lcnt = scl_lcnt_min + (uint32_t)(remaining / 2);
        scl_hcnt = total_hcnt_lcnt - scl_lcnt;
    }

    /* Set speed mode and write counters to responsing registers */
    IC_CON_TypeDef i2c_ctrl = {.d32 = I2Cx->IC_CON};
    if (I2C_ClockSpeed <= 100000)
    {
        /*Configure I2C speed in standard mode*/
        i2c_ctrl.b.speed = 0x1;
        I2Cx->IC_CON = i2c_ctrl.d32;
        I2Cx->IC_SS_SCL_LCNT = scl_lcnt & 0xFFFF;
        I2Cx->IC_SS_SCL_HCNT = scl_hcnt & 0xFFFF;
    }
    else
    {
        /* Configure I2C speed in fast mode or fast mode plus*/
        i2c_ctrl.b.speed = 0x2;
        I2Cx->IC_CON = i2c_ctrl.d32;
        I2Cx->IC_FS_SCL_LCNT = scl_lcnt & 0xFFFF;
        I2Cx->IC_FS_SCL_HCNT = scl_hcnt & 0xFFFF;
    }
}

#if (I2C_SUPPORT_RAP_FUNCTION == 1)

void I2C_WrapperModeCmd(I2C_TypeDef *I2Cx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    WRAP_CR_TypeDef i2c_0x10c = {.d32 = I2Cx->WRAP_CR};
    i2c_0x10c.b.wrapper_clk_en = NewState;
    I2Cx->WRAP_CR = i2c_0x10c.d32;
}

bool I2C_WrapperTransModeSet(I2C_TypeDef *I2Cx, uint32_t mode)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    WRAP_CR_TypeDef i2c_0x10c = {.d32 = I2Cx->WRAP_CR};
    i2c_0x10c.b.trans_mode = mode;
    I2Cx->WRAP_CR = i2c_0x10c.d32;
    return i2c_0x10c.b.wrapper_busy;
}

void I2C_WrapperWriteDataSet(I2C_TypeDef *I2Cx, uint8_t num, const uint8_t *buf)
{
    /* num should be less than 24 */
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    I2Cx->RAP_WCMD_NUM = num - 1;

    for (uint8_t i = 0; i < num; i++)
    {
        I2Cx->RAP_WCMD_DATA = *buf++;
    }
}

uint8_t I2C_WrapperGetTxFIFOLen(I2C_TypeDef *I2Cx)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    RAP_BUF_CR_TypeDef i2c_0x114 = {.d32 = I2Cx->RAP_BUF_CR};
    return i2c_0x114.b.wrap_buf_amount;
}

void I2C_WrapperTxFIFOClear(I2C_TypeDef *I2Cx)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    RAP_BUF_CR_TypeDef i2c_0x114 = {.d32 = I2Cx->RAP_BUF_CR};
    i2c_0x114.b.wrap_buf_clear = 1;
    I2Cx->RAP_BUF_CR = i2c_0x114.d32;
}


void I2C_WrapperReadNumSet(I2C_TypeDef *I2Cx, uint16_t num)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    I2Cx->RAP_RCMD_NUM = num - 1;
}


uint8_t I2C_WrapperReceiveData(I2C_TypeDef *I2Cx)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    /* Return the data in the DR register */
    return I2C_ReceiveData(I2Cx);
}

uint8_t I2C_WrapperGetRxFIFOLen(I2C_TypeDef *I2Cx)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    return I2C_GetRxFIFOLen(I2Cx);
}


void I2C_WrapperTransStart(I2C_TypeDef *I2Cx)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    WRAP_CR_TypeDef i2c_0x10c = {.d32 = I2Cx->WRAP_CR};
    i2c_0x10c.b.start_wrapper = 1;
    I2Cx->WRAP_CR = i2c_0x10c.d32;
}

bool I2C_WrapperBusyCheck(I2C_TypeDef *I2Cx)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    WRAP_CR_TypeDef i2c_0x10c = {.d32 = I2Cx->WRAP_CR};
    return i2c_0x10c.b.wrapper_busy;
}

void I2C_RAPModeCmd(I2C_TypeDef *I2Cx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    WRAP_CR_TypeDef i2c_0x10c = {.d32 = I2Cx->WRAP_CR};
    i2c_0x10c.b.rap_mode = NewState;
    I2Cx->WRAP_CR = i2c_0x10c.d32;
}

void I2C_TaskTrigger(I2C_TypeDef *I2Cx, uint32_t Task)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    I2Cx->RAP_TASK |= BIT(Task);
}

#endif
